---
kind: method
id: M:Autodesk.Revit.DB.Architecture.BalusterPattern.GetBalusterCount
source: html/ec2d8f6f-2b77-3a4f-70b4-910bafc07d90.htm
---
# Autodesk.Revit.DB.Architecture.BalusterPattern.GetBalusterCount Method

Gets the number of balusters in the main baluster pattern definition.

## Syntax (C#)
```csharp
public int GetBalusterCount()
```

## Returns
The number of balusters in the main baluster pattern.